Repository: jscad/OpenJSCAD.org
Catalog: blockly/demos/plane/xlf/translated_msgs_hrx.xlf
Languages: hrx

source: Rows: %1
hrx: Reihe: %1

source: seats =
hrx: Sitze =

source: An airplane has two seats in the flight deck (for the pilot and co-pilot), and a number of rows of 1st class and 2nd class passenger seats. Each 1st class row contains four seats. Each 2nd class row contains five seats.
hrx: En Fluchzeich hot zwooi Sitze im Pilotstand (für den Pilot und Co-Pilot) und en Oonzohl an Reihe mit Passagiersitze der 1. und 2. Klasse. Jede 1.-Klasse-Reih enthält vier Sitze. Jede 2.-Klasse-Reih enthält fünf Sitze.

source: Build a formula (below) that calculates the total number of seats on the airplane as the rows are changed (above).
hrx: Erstell en Formel (unne), die die gesamte Oonzohl an Sitze im Fluchzeich berechnet, wenn die Reihe (uwe) geännert sin.

source: An airplane has two seats in the flight deck (for the pilot and co-pilot), and a number of rows of passenger seats. Each row contains four seats.
hrx: En Fluchzeich hot zwooi Sitze im Pilotestand (für den Pilot und Co-Pilot) und en Oonzohl an Reihe mit Passagiersitze. Jede Reih enthält vier Sitze.

source: 1st class rows (%1)
hrx: Reihe von der 1. Klasse (%1)

source: 2nd class rows: %1
hrx: Reihe von der 2. Klasse: %1

source: Seats: %1
hrx: Sitz: %1

source: Plane Seat Calculator
hrx: Fluchzeichsitzrechner

source: rows (%1)
hrx: Reihe (%1)

source: 1st class rows: %1
hrx: Reihe von der 1. Klasse: %1

source: An airplane has a number of rows of passenger seats. Each row contains four seats.
hrx: En Fluchzeich hot en Oonzohl an Reihe mit Passagiersitze. Jede Reih enthält vier Sitze.

source: 2nd class rows (%1)
hrx: Reihe von der 2. Klasse (%1)
