Repository: jscad/OpenJSCAD.org
Catalog: blockly/demos/plane/xlf/translated_msgs_*.xlf
Languages: ar, br, ca, da, fa, fr, ia, it, ja, pt_br, sc, sv, th, tr

source: Rows: %1
ar: الصفوف: %1
br: Renkennadoù : %1
ca: Files: %1
da: Rækker: %1
fa: ردیف: %1
fr: Rangées : %1
ia: Filas: %1
it: File: %1
ja: 列の数: %1
pt_br: Filas: %1
sc: Fileras: %1
sv: Rader: %1
th: %1 แถว
tr: Sıralar: %1

source: seats =
ar: المقاعد =
br: azezennoù =
ca: seients =
da: sæder =
fa: صندلی‌ها =
fr: sièges =
ia: sedes =
it: sedili =
ja: 座席の数 =
pt_br: assentos =
sc: cadironis =
sv: säten =
th: จำนวนที่นั่ง =
tr: koltuklar =

source: An airplane has two seats in the flight deck (for the pilot and co-pilot), and a number of rows of 1st class and 2nd class passenger seats. Each 1st class row contains four seats. Each 2nd class row contains five seats.
ar: طائرة بمقعدين في مقطورة الطيّار (للطيار ومساعده) وعدد من المقاعد في صفوف الدرجة الأولى والثانية. كل صف من صفوف الدرجة الأولى يحتوي على أربعة مقاعد. ويحتوي كل صف في الدرجة الثانية على خمسة مقاعد.
br: En un nijerez ez eus div azezenn el logell leviañ(evit al loman hag an eil loman), hag un toullad renkennadoù azezennoù tremenidi kentañ hag eil klas. Peder azezenn zo e pep renkennad kentañ klas. Pemp azezenn zo e pemp renkennad eil klas.
ca: Un avió té dos seients en la cabina de vol (pel pilot i copilot) i un nombre de files per seients de passatgers de primera classe i de segona classe. Cada fila de primera classe conté quatre seients. Cada fila de segona classe conté cinc seients.
da: Et fly har to pladser i cockpittet (til pilot og med-pilot), og et antal rækker af 1. klasses og 2. klasses passagersæder. Hver 1. klasses række indeholder fire sæder. Hver 2. klasses række indeholder fem sæder.
fa: یک هواپیما دو صندلی در کابین خلبان دارد (برای خلبان و کمک خلبان) و تهداد از صندلی‌ها مسافرین درجه یک و درجه دو. هر ردیف درجه یک شامل چهار صندلی است. هر ردیف درجه دو شامل پنج صندلی است.
fr: Un avion a deux sièges dans la cabine de pilotage (pour le pilote et le copilote), et un certain nombre de rangées de sièges passager de première et seconde classes. Chaque rangée de première classe contient quatre sièges. Chaque rangée de seconde classe contient cinq sièges.
ia: Un avion ha duo sedes in le cabina (pro le pilota e le copilota) e un numero de filas de sedes pro passageros del prime classe e del secunde classes. Cata fila del prime classe contine quatro sedes. Cata fila del secunde classe contine cinque sedes.
it: Un aereo ha due posti nella cabina di pilotaggio (per il pilota e il co-pilota), e un numero di file in prima e seconda classe, con i posti a sedere dei passeggeri. Ogni fila della prima classe contiene quattro posti. Quelle invece della seconda classe, ne contengono cinque.
ja: 飛行機には、操縦室の 2 つの座席 (操縦士と副操縦士) と、ファーストクラスとセカンドクラスの乗客の座席の列があります。それぞれの列に、ファーストクラスでは 4 つの座席、セカンドクラスでは 5 つの座席があります。
pt_br: Um avião tem dois assentos na cabine de comando (para o piloto e o copiloto) e um número de filas de assentos na primeira e na segunda classe. Cada fila da primeira classe contém quatro assentos. Cada fila da segunda classe contém cinco assentos.
sc: Unu aparèchiu tenit duus cadironis in sa cabina de cumandu (po su pilota e su co-pilota), e unas cantu fileras de cadironis po passigeris de prima classi e de segunda classi. Dònnia filera de prima classi tenit cuatru cadironis. Dònnia filera de segunda classi tenit cincu cadironis.
sv: Ett flygplan har två säten i cockpiten (ett för piloten och ett för andrepiloten) och ett antal rader med passagerarsäten i första och andra klass. Varje rad i första klass innehåller fyra säten. Varje rad i andra klass innehåller fem säten.
th: ภายในเครื่องบินจะมีที่นั่งนักบินอยู่ 2 ที่ (สำหรับนักบิน และผู้ช่วยนักบิน) และจะมีแถวที่นั่งสำหรับผู้โดยสาร "ชั้นเฟิร์สคลาส" และ "ชั้นธุรกิจ" อยู่จำนวนหนึ่ง โดยในชั้นเฟิร์สคลาสจะมีแถวละ 4 ที่นั่ง ส่วนในชั้นธุรกิจจะมีแถวละ 5 ที่นั่ง
tr: Bir uçağın uçuş güvertesinde iki koltuğu (pilot ve yardımcı pilot için), ve belirli sayıda birinci sınıf ve ikinci sınıf yolcu koltuğu sırası vardır. Her birinci sınıf sıra dört koltuk içerir. Her ikinci sınıf sıra beş koltuk içerir.

source: Build a formula (below) that calculates the total number of seats on the airplane as the rows are changed (above).
ar: لبناء صيغة (أدناه) تقوم بحساب إجمالي عدد المقاعد في الطائرة عند تغيير الصفوف (أعلاه).
br: Sevel ur formulenn (amañ dindan) evit jediñ an niver a azezennoù en holl en nijerez pa vez kemmet an niver a renkennadoù (amañ a-us).
ca: Construïu una fórmula (a sota) que calculi el nombre total de seients de l'avió a mida que canviïn les files (a dalt).
da: Opbyg en formel (nedenfor), der beregner det samlede antal pladser på flyet, hvis antal rækker ændres (ovenfor).
fa: یک فرمول بسازید (پایین) که تعداد کل صندلی‌های هواپیما با تغییر ردیف را حساب کند (بالا).
fr: Construire une formule (ci-dessous) qui calcule le nombre total de sièges dans l’avion quand le nombre de rangées est modifié (ci-dessus).
ia: Construe un formula (ci infra) que calcula le numero total de sedes in le avion quando le numero de filas es cambiate (ci supra).
it: Costruisci una formula (sotto) che calcola il numero totale di posti a sedere su un aeroplano, così come cambiano le file di posti (sopra).
ja: 飛行機の座席の数を計算する式を、上で列の数を変更しても正しくなるように、下に入力してください。
pt_br: Elabore uma fórmula (abaixo) que calcule o número total de assentos no avião a medida que as filas são alteradas (acima).
sc: Cuncorda una formula (innoi asuta) chi cumpudit su numeru totali de postus a setzi in s'aparechiu, a segunda de comenti mudant is fileras de postus (innoi in susu)
sv: Bygg en formel (nedan) som beräknar det totala antalet säten på flygplanet när raderna ändras (ovan).
th: สร้างสูตรคำนวณ (ด้านล่าง) เพื่อคำนวณหาจำนวนที่นั่งทั้งหมดบนเครื่องบิน ตามจำนวนแถวที่เปลี่ยนไป (ด้านบน)
tr: Sıralar(üstte) değiştikçe uçaktaki toplam koltuk sayısını hesaplayan bir formül(altta) oluşturun.

source: An airplane has two seats in the flight deck (for the pilot and co-pilot), and a number of rows of passenger seats. Each row contains four seats.
ar: طائرة بمقعدين في مقطورة الطيّار (للطيار ومساعده) وعدد من الصفوف يحتوي كل صف على أربعة مقاعد.
br: En un nijerez ez eus div azezenn el logell leviañ(evit al loman hag an eil loman), hag ur toullad renkennadoù azezennoù evit an dremenidi. Peder azezenn zo e pep renkennad.
ca: Un avió té dos seients en la cabina de vol (pel pilot i pel copilot) i un nombre de files de seients de passatgers. Cada fila conté quatre seients.
da: Et fly har to pladser i cockpittet (til pilot og med-pilot), og et antal rækker af passagersæder. Hver række indeholder fire sæder.
fa: یک هواپیما دو صندلی در عرشهٔ پرواز دارد (برای خلبان و کمک خلبان) و تعدادی صندلی مسافرین. هر ردیف شامل چهار صندلی است.
fr: Un avion a deux sièges dans le poste de pilotage (pour le pilote et le copilote), et un certain nombre de rangées de sièges passager. Chaque rangée contient quatre sièges.
ia: Un avion ha duo sedes in le cabina (pro le pilota e le copilota) e un numero de filas de sedes pro passageros. Cata fila contine quatro sedes.
it: Un aeroplano ha due posti a sedere nella cabina di pilotaggio (per il pilota e co-pilota), e un numero di file con i posti a sedere dei passeggeri. Ogni fila contiene quattro posti.
ja: 飛行機には、操縦室の 2 つの座席 (操縦士と副操縦士) と、乗客の座席の列があります。それぞれの列に 4 つの座席があります。
pt_br: Um avião tem dois assentos na cabine de comando (para o piloto e o copiloto) e um número de filas de assentos para os passageiros. Cada fila contém quatro assentos.
sc: Unu aparèchiu tenit duus cadironis in sa cabina de cumandu (po su pilota e su co-pilota), e unas cantu fileras de cadironis po passigeris. Dònnia filera tenit cuatru cadironis.
sv: Ett flygplan har två säten i cockpiten (ett för piloten och ett för andrepiloten) och ett antal rader med passagerarsäten. Varje rad innehåller fyra säten.
th: ภายในเครื่องบินจะมีที่นั่งนักบินอยู่ 2 ที่ (สำหรับนักบิน และผู้ช่วยนักบิน) และมีแถวที่นั่งผู้โดยสารอยู่จำนวนหนึ่ง ในแต่ละแถวจะมี 4 ที่นั่ง
tr: Bir uçağın uçuş güvertesinde iki koltuğu (pilot ve yardımcı pilot için), ve belirli sayıda koltuk sırası vardır. Her sıra dört koltuk içerir.

source: 1st class rows (%1)
ar: صفوف الطبقة الأولى (%1)
br: Renkennadoù kentañ klas (%1)
ca: files de primera classe (%1)
da: 1. klasse rækker (%1)
fa: اولین کلاس ردیف‌ها (%1)
fr: rangées de première classe (%1)
ia: filas de prime classe (%1)
it: file 1ª classe (%1)
ja: ファーストクラスの列数 (%1)
pt_br: filas na primeira classe (%1)
sc: fileras de primu classi (%1)
sv: Rader i första klass (%1)
th: จำนวนแถวชั้นเฟิร์สคลาส (%1)
tr: Birinci sınıf sıralar (%1)

source: 2nd class rows: %1
ar: صفوف الفئة الثانية: %1
br: Renkennadoù eil klas : %1
ca: files de segona classe: %1
da: 2. klasse rækker: %1
fa: دومین کلاس ردیف: %1
fr: rangées de seconde classe : %1
ia: Filas de secunde classe: %1
it: File 2ª classe: %1
ja: セカンドクラスの列数: %1
pt_br: filas na segunda classe: %1
sc: fileras de segunda classi: %1
sv: Rader i andra klass: %1
th: ชั้นธุรกิจ %1 แถว
tr: İkinci sınıf sıralar: %1

source: Seats: %1
ar: المقاعد: %1
br: Azezennoù : %1
ca: Seients: %1
da: Sæder: %1
fa: صندلی‌ها: %1
fr: Sièges : %1
ia: Sedes: %1
it: Sedili: %1
ja: 座席の数: %1
pt_br: Assentos: %1
sc: Cadironis: %1
sv: Säten: %1
th: คำนวณได้ทั้งหมด %1 ที่นั่ง
tr: Koltuklar: %1

source: Plane Seat Calculator
ar: آلة حاسبة لمقعد الطائرة
br: Jederez azezenn nijerez
ca: Calculadora de seients d'avió
da: Flysædelommeregner
fa: محاسبه‌گر صندلی‌های هواپیما
fr: Calculateur de sièges d’avion
ia: Calculator de sedias de avion
it: Calcolo posti aereo
ja: 飛行機座席計算機
pt_br: Calculadora de Assentos em Avião
sc: Fai su contu de is cadironis de unu aparèchiu
sv: Plansäteskalkylator
th: ระบบคำนวณที่นั่งบนเครื่องบิน
tr: Uçak Koltuğu Hesaplayıcı

source: rows (%1)
ar: الصفوف (%1)
br: renkennadoù (%1)
ca: files (%1)
da: rækker (%1)
fa: ردیف‌ها (%1)
fr: rangées (%1)
ia: filas (%1)
it: file (%1)
ja: 列の数 (%1)
pt_br: filas (%1)
sc: fileras (%1)
sv: rader (%1)
th: จำนวนแถว (%1)
tr: sıralar (%1)

source: 1st class rows: %1
ar: صفوف الطبقة الأولى: %1
br: Renkennadoù kentañ klas : %1
ca: files de primera classe: %1
da: 1. klasse rækker: %1
fa: اولین ردیف کلاس: %1
fr: rangées de première classe : %1
ia: Filas de prime classe: %1
it: File 1ª classe: %1
ja: ファーストクラスの列数: %1
pt_br: filas na primeira classe: %1
sc: fileras de primu classi: %1
sv: Rader i första klass: %1
th: ชั้นเฟิร์สคลาส %1 แถว
tr: Birinci sınıf sıralar: (%1)

source: An airplane has a number of rows of passenger seats. Each row contains four seats.
ar: هنالك طائرة تحتوي على عدد من صفوف مقاعد الركاب. كل صف يحتوي على أربعة مقاعد.
br: Un nijerez he deus un toullad renkennadoù azezennoù evit ar veajourien. Peder azezenn a zo e pep renkennad.
ca: Un avió té un nombre de files de seients de passatgers. Cada fila conté quatre seients.
da: Et fly har et antal rækker af passagersæder. Hver række indeholder fire sæder.
fa: یک هواپیما تعداد از صندلی‌های مسافرین را دارد. هر ردیف شمال چهار صندلی است.
fr: Un avion a un nombre de rangées de sièges passager. Chaque rangée contient quatre sièges.
ia: Un avion ha un numero de filas de sedes pro passageros. Cata fila contine quatro sedes.
it: Un aeroplano ha un numero di file contenenti i posti a sedere dei passeggeri. Ogni fila, contiene quattro posti a sedere.
ja: 飛行機に乗客の座席の列があります。それぞれの列に 4 つの座席があります。
pt_br: Um avião tem um número de filas de assentos para os passageiros. Cada fila contém quatro assentos.
sc: Unu aparèchiu tenit unas cantu fileras de cadironis po passigeris. Dònnia filera tenit cuatru cadironis.
sv: Ett flygplan har ett antal rader med passagerarsäten. Varje rad innehåller fyra säten.
th: ภายในเครื่องบินประกอบไปด้วยแถวของที่นั่งผู้โดยสาร ในแต่ละแถวจะมี 4 ที่นั่ง
tr: Bir uçağın belirli sayıda koltuk sırası vardır. Her sıra dört koltuk içerir.

source: 2nd class rows (%1)
ar: صفوف الفئة الثانية: (%1)
br: Renkennadoù eil klas (%1)
ca: files de segona classe (%1)
da: 2. klasse rækker (%1)
fa: دومین کلاس ردیف‌ها (%1)
fr: rangées de seconde classe (%1)
ia: filas de secunde classe (%1)
it: File 2ª classe (%1)
ja: セカンドクラスの列数 (%1)
pt_br: filas na segunda classe (%1)
sc: fileras de segunda classi (%1)
sv: Rader i andra klass (%1)
th: จำนวนแถวชั้นธุรกิจ (%1)
tr: İkinci sınıf sıralar (%1)
